controllers/NossfOsmController.php

SELECT MAX(queued), `waktu` FROM `nossf_osm_order_queue` WHERE `waktu` > DATE_SUB(NOW(), INTERVAL 2 HOUR) GROUP BY `waktu`
---
    public function actionIndex() {
//        $request = Yii::$app->request;
        $timeParam = 'DATE_SUB(NOW(), INTERVAL 3 HOUR)';
//        $dataLabel = NossfOsmOrderQueue::find()
//                ->select(['waktu'])
//                ->distinct()
//                ->where(['>', 'waktu', new Expression($timeParam)])
//                ->all();
        $data = NossfOsmOrderQueue::find()
                ->select(['MAX(queued)', 'waktu'])
                ->where(['>', 'waktu', new Expression($timeParam)])
                ->groupBy(['waktu'])
                ->asArray()
                ->all();

SELECT MAX(queued), `waktu` FROM `nossf_osm_order_queue` WHERE (`waktu` >= '2018-05-25 12:00') AND (`waktu` <= '2018-05-25 14:27') GROUP BY `waktu`
---
    public function actionAjaxchart() {
        $request = Yii::$app->request;
        $start = "'" . $request->post("start") . "'";
        $end = "'" . $request->post("end") . "'";

        if (($start != "") && ($end != "")) {
            $modelData = NossfOsmOrderQueue::find()
                    ->select(['MAX(queued)', 'waktu'])
                    ->where(['>=', 'waktu', new Expression($start)])
                    ->andWhere(['<=', 'waktu', new Expression($end)])
                    ->groupBy(['waktu'])
                    ->asArray()
                    ->all();

SELECT MAX(queued), `waktu` FROM `nossf_osm_order_queue` WHERE `waktu` > DATE_SUB(NOW(), INTERVAL 2 HOUR) GROUP BY `waktu`
---
    public function actionOrderqueue() {
        $dataProvider = new ActiveDataProvider([
            'query' => NossfOsmOrderQueue::find()
//                    ->where(['in', 'waktu', NossaStatusIntegrasi::find()->select('waktu')])
                    ->where(['=', 'waktu', NossfOsmOrderQueue::find()->select('waktu')->orderBy(['waktu' => SORT_DESC])->limit(1)])
                ,
        ]);